jonacappelle/nRF52-BLE-IMU/ble_services/ble_tms.c
    memset(&attr_char_value, 0, sizeof(attr_char_value));

    attr_char_value.p_uuid    = &ble_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = sizeof(ble_tms_config_t);
    attr_char_value.init_offs = 0;
    attr_char_value.p_value   = (uint8_t *)p_tms_init->p_init_config;
    attr_char_value.max_len   = sizeof(ble_tms_config_t);

    return sd_ble_gatts_characteristic_add(p_tms->service_handle,
                                           &char_md,
                                           &attr_char_value,
                                           &p_tms->config_handles);
}


void ble_tms_on_ble_evt(ble_tms_t * p_tms, ble_evt_t * p_ble_evt)
{

    if ((p_tms == NULL) || (p_ble_evt == NULL))
    {
        return;
    }

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            on_connect(p_tms, p_ble_evt);
            NRF_LOG_DEBUG("BLE_GAP_EVT_CONNECTED");
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            on_disconnect(p_tms, p_ble_evt);
            NRF_LOG_DEBUG("BLE_GAP_EVT_DISCONNECTED");
            break;

        case BLE_GATTS_EVT_WRITE:
            on_write(p_tms, p_ble_evt);
            NRF_LOG_DEBUG("BLE_GATTS_EVT_WRITE");
            break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
            on_authorize_req(p_tms, p_ble_evt);
            NRF_LOG_DEBUG("BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST");
            break;

        default:
            // No implementation needed.
            break;
    }
}


uint32_t ble_tms_init(ble_tms_t * p_tms, const ble_tms_init_t * p_tms_init)
{
    uint32_t      err_code;
    ble_uuid_t    ble_uuid;
    ble_uuid128_t tms_base_uuid = TMS_BASE_UUID;

    VERIFY_PARAM_NOT_NULL(p_tms);
    VERIFY_PARAM_NOT_NULL(p_tms_init);

    // Initialize the service structure.
    p_tms->conn_handle                  = BLE_CONN_HANDLE_INVALID;
    p_tms->evt_handler                  = p_tms_init->evt_handler;
    p_tms->is_tap_notif_enabled         = false;
    p_tms->is_adc_notif_enabled = false;
    p_tms->is_quat_notif_enabled        = false;
    p_tms->is_pedo_notif_enabled        = false;
    p_tms->is_raw_notif_enabled         = false;
    p_tms->is_euler_notif_enabled       = false;
    p_tms->is_rot_mat_notif_enabled     = false;
    p_tms->is_heading_notif_enabled     = false;
    p_tms->is_gravity_notif_enabled     = false;


    // Add a custom base UUID.
    err_code = sd_ble_uuid_vs_add(&tms_base_uuid, &p_tms->uuid_type);
    VERIFY_SUCCESS(err_code);

    ble_uuid.type = p_tms->uuid_type;
    ble_uuid.uuid = BLE_UUID_TMS_SERVICE;

    // Add the service.
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                        &ble_uuid,
                                        &p_tms->service_handle);
    VERIFY_SUCCESS(err_code);

    /* Add characteristics */
    // Add the configuration characteristic.
    err_code = config_char_add(p_tms, p_tms_init);
    VERIFY_SUCCESS(err_code);
    // Add the tap characteristic.
    // err_code = tap_char_add(p_tms, p_tms_init);
    // VERIFY_SUCCESS(err_code);
    // Add the adc characteristic.
    err_code = adc_char_add(p_tms, p_tms_init);
    VERIFY_SUCCESS(err_code);
    // Add the quaternion characteristic.
    err_code = quat_char_add(p_tms, p_tms_init);
    VERIFY_SUCCESS(err_code);
    // Add the pedometer characteristic.
    // err_code = pedo_char_add(p_tms, p_tms_init);
    // VERIFY_SUCCESS(err_code);
    // Add the raw data characteristic.
    err_code = raw_char_add(p_tms, p_tms_init);
    VERIFY_SUCCESS(err_code);
    // Add the euler angle characteristic.
    err_code = euler_char_add(p_tms, p_tms_init);
    VERIFY_SUCCESS(err_code);
    // Add the rotation matrix characteristic.
    // err_code = rot_mat_char_add(p_tms, p_tms_init);
    // VERIFY_SUCCESS(err_code);
    // Add the compass heading characteristic.
    // err_code = heading_char_add(p_tms, p_tms_init);
    // VERIFY_SUCCESS(err_code);
    // Add the gravity vector characteristic.
    // err_code = gravity_char_add(p_tms, p_tms_init);
    // VERIFY_SUCCESS(err_code);

    return NRF_SUCCESS;
}


uint32_t ble_tms_tap_set(ble_tms_t * p_tms, ble_tms_tap_t * p_data)
{
    ble_gatts_hvx_params_t hvx_params;
    uint16_t               length = sizeof(ble_tms_tap_t);

    VERIFY_PARAM_NOT_NULL(p_tms);

    if ((p_tms->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_tms->is_tap_notif_enabled))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (length > BLE_TMS_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_tms->tap_handles.value_handle;
    hvx_params.p_data = (uint8_t *)p_data;
    hvx_params.p_len  = &length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(p_tms->conn_handle, &hvx_params);
}


uint32_t ble_tms_adc_set(ble_tms_t * p_tms, ble_tms_adc_t * p_data)
{
    ble_gatts_hvx_params_t hvx_params;
    uint16_t               length = sizeof(ble_tms_adc_t);

    VERIFY_PARAM_NOT_NULL(p_tms);

    if ((p_tms->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_tms->is_adc_notif_enabled))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (length > BLE_TMS_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_tms->adc_handles.value_handle;
    hvx_params.p_data = (uint8_t *)p_data;
    hvx_params.p_len  = &length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(p_tms->conn_handle, &hvx_params);
}


uint32_t ble_tms_quat_set(ble_tms_t * p_tms, ble_tms_quat_t * p_data)
{
    ble_gatts_hvx_params_t hvx_params;
    uint16_t               length = sizeof(ble_tms_quat_t);

    VERIFY_PARAM_NOT_NULL(p_tms);

    if ((p_tms->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_tms->is_quat_notif_enabled))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (length > BLE_TMS_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_tms->quat_handles.value_handle;
    hvx_params.p_data = (uint8_t *)p_data;
    hvx_params.p_len  = &length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

