jonacappelle/nRF52-BLE-IMU/ble_services/ble_tms.c
    return sd_ble_gatts_hvx(p_tms->conn_handle, &hvx_params);
}


uint32_t ble_tms_pedo_set(ble_tms_t * p_tms, ble_tms_pedo_t * p_data)
{
    ble_gatts_hvx_params_t hvx_params;
    uint16_t               length = sizeof(ble_tms_pedo_t);

    VERIFY_PARAM_NOT_NULL(p_tms);

    if ((p_tms->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_tms->is_pedo_notif_enabled))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (length > BLE_TMS_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_tms->pedo_handles.value_handle;
    hvx_params.p_data = (uint8_t *)p_data;
    hvx_params.p_len  = &length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(p_tms->conn_handle, &hvx_params);
}


uint32_t ble_tms_raw_set(ble_tms_t * p_tms, ble_tms_raw_t * p_data)
{
    ble_gatts_hvx_params_t hvx_params;
    uint16_t               length = sizeof(ble_tms_raw_t);

    VERIFY_PARAM_NOT_NULL(p_tms);

    if ((p_tms->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_tms->is_raw_notif_enabled))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (length > BLE_TMS_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_tms->raw_handles.value_handle;
    hvx_params.p_data = (uint8_t *)p_data;
    hvx_params.p_len  = &length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(p_tms->conn_handle, &hvx_params);
}


uint32_t ble_tms_euler_set(ble_tms_t * p_tms, ble_tms_euler_t * p_data)
{
    ble_gatts_hvx_params_t hvx_params;
    uint16_t               length = sizeof(ble_tms_euler_t);

    VERIFY_PARAM_NOT_NULL(p_tms);

    if ((p_tms->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_tms->is_euler_notif_enabled))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (length > BLE_TMS_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_tms->euler_handles.value_handle;
    hvx_params.p_data = (uint8_t *)p_data;
    hvx_params.p_len  = &length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(p_tms->conn_handle, &hvx_params);
}


uint32_t ble_tms_rot_mat_set(ble_tms_t * p_tms, ble_tms_rot_mat_t * p_data)
{
    ble_gatts_hvx_params_t hvx_params;
    uint16_t               length = sizeof(ble_tms_rot_mat_t);

    VERIFY_PARAM_NOT_NULL(p_tms);

    if ((p_tms->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_tms->is_rot_mat_notif_enabled))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (length > BLE_TMS_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_tms->rot_mat_handles.value_handle;
    hvx_params.p_data = (uint8_t *)p_data;
    hvx_params.p_len  = &length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(p_tms->conn_handle, &hvx_params);
}


uint32_t ble_tms_heading_set(ble_tms_t * p_tms, ble_tms_heading_t * p_data)
{
    ble_gatts_hvx_params_t hvx_params;
    uint16_t               length = sizeof(ble_tms_heading_t);

    VERIFY_PARAM_NOT_NULL(p_tms);

    if ((p_tms->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_tms->is_heading_notif_enabled))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (length > BLE_TMS_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_tms->heading_handles.value_handle;
    hvx_params.p_data = (uint8_t *)p_data;
    hvx_params.p_len  = &length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(p_tms->conn_handle, &hvx_params);
}


uint32_t ble_tms_gravity_set(ble_tms_t * p_tms, ble_tms_gravity_t * p_data)
{
    ble_gatts_hvx_params_t hvx_params;
    uint16_t               length = sizeof(ble_tms_gravity_t);

    VERIFY_PARAM_NOT_NULL(p_tms);

    if ((p_tms->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_tms->is_gravity_notif_enabled))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (length > BLE_TMS_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_tms->gravity_handles.value_handle;
    hvx_params.p_data = (uint8_t *)p_data;
    hvx_params.p_len  = &length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(p_tms->conn_handle, &hvx_params);
}
